In [2]:
# importing required libraries
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [3]:
# reading the given dataset
train_data = pd.read_csv("training_data.csv")
train_data.head(2)

,times,Series1,Series2,Series3,Series4,Series5,Series6,Series7,Series8,Series9,...,Series86,Series87,Series88,Series89,Series90,Series91,Series92,Series93,Series94,Series95
0,1978-11-01,260.350122,265.379448,285.172883,266.774733,256.704939,259.962472,263.321555,262.017348,263.854085,...,258.222624,274.719836,261.387957,254.903019,268.261197,267.028705,271.567729,266.947571,271.930426,271.223367
1,1978-11-02,259.943367,273.526405,266.913075,269.664513,265.024105,263.013930,263.091900,254.997818,273.320973,...,260.759755,256.765620,261.998367,253.702352,259.935957,267.853531,271.902175,267.027663,273.179384,261.041906

In [4]:
fake_pub_data = pd.read_csv("public_fake_test_data.csv")
fake_pub_data.head(2)

,times,Series1,Series2,Series3,Series4,Series5,Series6,Series7,Series8,Series9,...,Series86,Series87,Series88,Series89,Series90,Series91,Series92,Series93,Series94,Series95
0,1991-02-26,221.906904,209.384404,212.940469,210.951168,200.843305,215.455393,203.517218,214.127919,226.265642,...,213.984178,209.19355,206.859867,216.48676,213.265123,221.629532,217.60735,227.577026,211.2203,224.895289
1,1991-02-27,221.906904,209.384404,212.940469,210.951168,200.843305,215.455393,203.517218,214.127919,226.265642,...,213.984178,209.19355,206.859867,216.48676,213.265123,221.629532,217.60735,227.577026,211.2203,224.895289

In [5]:
def basic_data_understanding(data):
    min_date = data['times'].min()
    max_date = data['times'].max()
    data_info = data.info()
    print("Min Date:", min_date, "|| Max Date:", max_date, "\nData info:\n", data_info)
#     return "Min"min_date, max_date, data_type, check_null

In [6]:
basic_data_understanding(fake_pub_data)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 801 entries, 0 to 800
Data columns (total 96 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   times     801 non-null    object
 1   Series1   801 non-null    float64
 2   Series2   801 non-null    float64
 3   Series3   801 non-null    float64
 4   Series4   801 non-null    float64
 5   Series5   801 non-null    float64
 6   Series6   801 non-null    float64
 7   Series7   801 non-null    float64
 8   Series8   801 non-null    float64
 9   Series9   801 non-null    float64
 10  Series10  801 non-null    float64
 11  Series11  801 non-null    float64
 12  Series12  801 non-null    float64
 13  Series13  801 non-null    float64
 14  Series14  801 non-null    float64
 15  Series15  801 non-null    float64
 16  Series16  801 non-null    float64
 17  Series17  801 non-null    float64
 18  Series18  801 non-null    float64
 19  Series19  801 non-null    float64
 20  Series20  801 non-null    float64
 21  Series21  801 non-null    float64
 22  Series22  801 non-null    float64
 23  Series23  801 non-null    float64
 24  Series24  801 non-null    float64
 25  Series25  801 non-null    float64
 26  Series26  801 non-null    float64
 27  Series27  801 non-null    float64
 28  Series28  801 non-null    float64
 29  Series29  801 non-null    float64
 30  Series30  801 non-null    float64
 31  Series31  801 non-null    float64
 32  Series32  801 non-null    float64
 33  Series33  801 non-null    float64
 34  Series34  801 non-null    float64
 35  Series35  801 non-null    float64
 36  Series36  801 non-null    float64
 37  Series37  801 non-null    float64
 38  Series38  801 non-null    float64
 39  Series39  801 non-null    float64
 40  Series40  801 non-null    float64
 41  Series41  801 non-null    float64
 42  Series42  801 non-null    float64
 43  Series43  801 non-null    float64
 44  Series44  801 non-null    float64
 45  Series45  801 non-null    float64
 46  Series46  801 non-null    float64
 47  Series47  801 non-null    float64
 48  Series48  801 non-null    float64
 49  Series49  801 non-null    float64
 50  Series50  801 non-null    float64
 51  Series51  801 non-null    float64
 52  Series52  801 non-null    float64
 53  Series53  801 non-null    float64
 54  Series54  801 non-null    float64
 55  Series55  801 non-null    float64
 56  Series56  801 non-null    float64
 57  Series57  801 non-null    float64
 58  Series58  801 non-null    float64
 59  Series59  801 non-null    float64
 60  Series60  801 non-null    float64
 61  Series61  801 non-null    float64
 62  Series62  801 non-null    float64
 63  Series63  801 non-null    float64
 64  Series64  801 non-null    float64
 65  Series65  801 non-null    float64
 66  Series66  801 non-null    float64
 67  Series67  801 non-null    float64
 68  Series68  801 non-null    float64
 69  Series69  801 non-null    float64
 70  Series70  801 non-null    float64
 71  Series71  801 non-null    float64
 72  Series72  801 non-null    float64
 73  Series73  801 non-null    float64
 74  Series74  801 non-null    float64
 75  Series75  801 non-null    float64
 76  Series76  801 non-null    float64
 77  Series77  801 non-null    float64
 78  Series78  801 non-null    float64
 79  Series79  801 non-null    float64
 80  Series80  801 non-null    float64
 81  Series81  801 non-null    float64
 82  Series82  801 non-null    float64
 83  Series83  801 non-null    float64
 84  Series84  801 non-null    float64
 85  Series85  801 non-null    float64
 86  Series86  801 non-null    float64
 87  Series87  801 non-null    float64
 88  Series88  801 non-null    float64
 89  Series89  801 non-null    float64
 90  Series90  801 non-null    float64
 91  Series91  801 non-null    float64
 92  Series92  801 non-null    float64
 93  Series93  801 non-null    float64
 94  Series94  801 non-null    float64
 95  Series95  801 non-null    float64
dtypes: float64(95), object(1)
memory usage: 600.9+ KB
Min Date: 1991-02-26 || Max Date: 1993-05-06
Data info:
 None

In [7]:
basic_data_understanding(train_data)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 96 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   times     4500 non-null   object
 1   Series1   4500 non-null   float64
 2   Series2   4500 non-null   float64
 3   Series3   4500 non-null   float64
 4   Series4   4500 non-null   float64
 5   Series5   4500 non-null   float64
 6   Series6   4500 non-null   float64
 7   Series7   4500 non-null   float64
 8   Series8   4500 non-null   float64
 9   Series9   4500 non-null   float64
 10  Series10  4500 non-null   float64
 11  Series11  4500 non-null   float64
 12  Series12  4500 non-null   float64
 13  Series13  4500 non-null   float64
 14  Series14  4500 non-null   float64
 15  Series15  4500 non-null   float64
 16  Series16  4500 non-null   float64
 17  Series17  4500 non-null   float64
 18  Series18  4500 non-null   float64
 19  Series19  4500 non-null   float64
 20  Series20  4500 non-null   float64
 21  Series21  4500 non-null   float64
 22  Series22  4500 non-null   float64
 23  Series23  4500 non-null   float64
 24  Series24  4500 non-null   float64
 25  Series25  4500 non-null   float64
 26  Series26  4500 non-null   float64
 27  Series27  4500 non-null   float64
 28  Series28  4500 non-null   float64
 29  Series29  4500 non-null   float64
 30  Series30  4500 non-null   float64
 31  Series31  4500 non-null   float64
 32  Series32  4500 non-null   float64
 33  Series33  4500 non-null   float64
 34  Series34  4500 non-null   float64
 35  Series35  4500 non-null   float64
 36  Series36  4500 non-null   float64
 37  Series37  4500 non-null   float64
 38  Series38  4500 non-null   float64
 39  Series39  4500 non-null   float64
 40  Series40  4500 non-null   float64
 41  Series41  4500 non-null   float64
 42  Series42  4500 non-null   float64
 43  Series43  4500 non-null   float64
 44  Series44  4500 non-null   float64
 45  Series45  4500 non-null   float64
 46  Series46  4500 non-null   float64
 47  Series47  4500 non-null   float64
 48  Series48  4500 non-null   float64
 49  Series49  4500 non-null   float64
 50  Series50  4500 non-null   float64
 51  Series51  4500 non-null   float64
 52  Series52  4500 non-null   float64
 53  Series53  4500 non-null   float64
 54  Series54  4500 non-null   float64
 55  Series55  4500 non-null   float64
 56  Series56  4500 non-null   float64
 57  Series57  4500 non-null   float64
 58  Series58  4500 non-null   float64
 59  Series59  4500 non-null   float64
 60  Series60  4500 non-null   float64
 61  Series61  4500 non-null   float64
 62  Series62  4500 non-null   float64
 63  Series63  4500 non-null   float64
 64  Series64  4500 non-null   float64
 65  Series65  4500 non-null   float64
 66  Series66  4500 non-null   float64
 67  Series67  4500 non-null   float64
 68  Series68  4500 non-null   float64
 69  Series69  4500 non-null   float64
 70  Series70  4500 non-null   float64
 71  Series71  4500 non-null   float64
 72  Series72  4500 non-null   float64
 73  Series73  4500 non-null   float64
 74  Series74  4500 non-null   float64
 75  Series75  4500 non-null   float64
 76  Series76  4500 non-null   float64
 77  Series77  4500 non-null   float64
 78  Series78  4500 non-null   float64
 79  Series79  4500 non-null   float64
 80  Series80  4500 non-null   float64
 81  Series81  4500 non-null   float64
 82  Series82  4500 non-null   float64
 83  Series83  4500 non-null   float64
 84  Series84  4500 non-null   float64
 85  Series85  4500 non-null   float64
 86  Series86  4500 non-null   float64
 87  Series87  4500 non-null   float64
 88  Series88  4500 non-null   float64
 89  Series89  4500 non-null   float64
 90  Series90  4500 non-null   float64
 91  Series91  4500 non-null   float64
 92  Series92  4500 non-null   float64
 93  Series93  4500 non-null   float64
 94  Series94  4500 non-null   float64
 95  Series95  4500 non-null   float64
dtypes: float64(95), object(1)
memory usage: 3.3+ MB
Min Date: 1978-11-01 || Max Date: 1991-02-25
Data info:
 None

### Converting object to timestamp

In [8]:
def convert_timestamp(data):
    if data.dtypes['times'] == object:
        data['times'] = pd.to_datetime(data.times)
        return data 
    else:
        return data

In [9]:
basic_data_understanding(convert_timestamp(train_data))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 96 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   times     4500 non-null   datetime64[ns]
 1   Series1   4500 non-null   float64
 2   Series2   4500 non-null   float64
 3   Series3   4500 non-null   float64
 4   Series4   4500 non-null   float64
 5   Series5   4500 non-null   float64
 6   Series6   4500 non-null   float64
 7   Series7   4500 non-null   float64
 8   Series8   4500 non-null   float64
 9   Series9   4500 non-null   float64
 10  Series10  4500 non-null   float64
 11  Series11  4500 non-null   float64
 12  Series12  4500 non-null   float64
 13  Series13  4500 non-null   float64
 14  Series14  4500 non-null   float64
 15  Series15  4500 non-null   float64
 16  Series16  4500 non-null   float64
 17  Series17  4500 non-null   float64
 18  Series18  4500 non-null   float64
 19  Series19  4500 non-null   float64
 20  Series20  4500 non-null   float64
 21  Series21  4500 non-null   float64
 22  Series22  4500 non-null   float64
 23  Series23  4500 non-null   float64
 24  Series24  4500 non-null   float64
 25  Series25  4500 non-null   float64
 26  Series26  4500 non-null   float64
 27  Series27  4500 non-null   float64
 28  Series28  4500 non-null   float64
 29  Series29  4500 non-null   float64
 30  Series30  4500 non-null   float64
 31  Series31  4500 non-null   float64
 32  Series32  4500 non-null   float64
 33  Series33  4500 non-null   float64
 34  Series34  4500 non-null   float64
 35  Series35  4500 non-null   float64
 36  Series36  4500 non-null   float64
 37  Series37  4500 non-null   float64
 38  Series38  4500 non-null   float64
 39  Series39  4500 non-null   float64
 40  Series40  4500 non-null   float64
 41  Series41  4500 non-null   float64
 42  Series42  4500 non-null   float64
 43  Series43  4500 non-null   float64
 44  Series44  4500 non-null   float64
 45  Series45  4500 non-null   float64
 46  Series46  4500 non-null   float64
 47  Series47  4500 non-null   float64
 48  Series48  4500 non-null   float64
 49  Series49  4500 non-null   float64
 50  Series50  4500 non-null   float64
 51  Series51  4500 non-null   float64
 52  Series52  4500 non-null   float64
 53  Series53  4500 non-null   float64
 54  Series54  4500 non-null   float64
 55  Series55  4500 non-null   float64
 56  Series56  4500 non-null   float64
 57  Series57  4500 non-null   float64
 58  Series58  4500 non-null   float64
 59  Series59  4500 non-null   float64
 60  Series60  4500 non-null   float64
 61  Series61  4500 non-null   float64
 62  Series62  4500 non-null   float64
 63  Series63  4500 non-null   float64
 64  Series64  4500 non-null   float64
 65  Series65  4500 non-null   float64
 66  Series66  4500 non-null   float64
 67  Series67  4500 non-null   float64
 68  Series68  4500 non-null   float64
 69  Series69  4500 non-null   float64
 70  Series70  4500 non-null   float64
 71  Series71  4500 non-null   float64
 72  Series72  4500 non-null   float64
 73  Series73  4500 non-null   float64
 74  Series74  4500 non-null   float64
 75  Series75  4500 non-null   float64
 76  Series76  4500 non-null   float64
 77  Series77  4500 non-null   float64
 78  Series78  4500 non-null   float64
 79  Series79  4500 non-null   float64
 80  Series80  4500 non-null   float64
 81  Series81  4500 non-null   float64
 82  Series82  4500 non-null   float64
 83  Series83  4500 non-null   float64
 84  Series84  4500 non-null   float64
 85  Series85  4500 non-null   float64
 86  Series86  4500 non-null   float64
 87  Series87  4500 non-null   float64
 88  Series88  4500 non-null   float64
 89  Series89  4500 non-null   float64
 90  Series90  4500 non-null   float64
 91  Series91  4500 non-null   float64
 92  Series92  4500 non-null   float64
 93  Series93  4500 non-null   float64
 94  Series94  4500 non-null   float64
 95  Series95  4500 non-null   float64
dtypes: datetime64[ns](1), float64(95)
memory usage: 3.3 MB
Min Date: 1978-11-01 00:00:00 || Max Date: 1991-02-25 00:00:00
Data info:
 None

### Data basic understanding

**Train Data:** \
-- Min Date: 1978-11-01 00:00:00 || Max Date: 1991-02-25 00:00:00 \
-- Total records: 4500 entries\
-- No missing values in any of the records

**fake_pub_data:** \
-- Min Date: 1991-02-26 || Max Date: 1993-05-06 \
-- Total records: 801 entries\
-- No missing values in any of the records

### Setting time object as index

In [12]:
train_data1 = train_data.set_index('times')
train_data1.head(2)

,Series1,Series2,Series3,Series4,Series5,Series6,Series7,Series8,Series9,Series10,...,Series86,Series87,Series88,Series89,Series90,Series91,Series92,Series93,Series94,Series95
times,,,,,,,,,,,,,,,,,,,,,
1978-11-01,260.350122,265.379448,285.172883,266.774733,256.704939,259.962472,263.321555,262.017348,263.854085,272.871388,...,258.222624,274.719836,261.387957,254.903019,268.261197,267.028705,271.567729,266.947571,271.930426,271.223367
1978-11-02,259.943367,273.526405,266.913075,269.664513,265.024105,263.013930,263.091900,254.997818,273.320973,268.203996,...,260.759755,256.765620,261.998367,253.702352,259.935957,267.853531,271.902175,267.027663,273.179384,261.041906

### Weekly aggregation

In [16]:
df_weekly = train_data.groupby(pd.Grouper(key='times',freq='W')).sum()
# df_weekly1 = df_weekly.reset_index(level =['Date'])
df_weekly.head(3)

,Series1,Series2,Series3,Series4,Series5,Series6,Series7,Series8,Series9,Series10,...,Series86,Series87,Series88,Series89,Series90,Series91,Series92,Series93,Series94,Series95
times,,,,,,,,,,,,,,,,,,,,,
1978-11-05,1304.730170,1338.624324,1350.916401,1317.343844,1180.289057,1300.200680,1306.105590,1297.507665,1184.200970,1378.883843,...,1286.825896,1308.711412,1293.667502,1289.824884,1308.813435,1328.431382,1361.895928,1279.894699,1361.870991,1337.179163
1978-11-12,1794.347179,1823.047997,1833.084137,1820.801373,1787.470327,1820.419606,1816.931031,1878.801365,3645.516819,1902.794669,...,1830.377237,1757.248391,1684.742270,1831.791919,1829.276312,1869.100983,1889.405363,1833.792927,1864.154420,1908.670035
1978-11-19,1750.186165,1814.972590,1823.850399,1763.190822,1803.962904,1808.079139,1803.050251,1851.496790,1842.466738,1926.178422,...,1772.834534,1761.612286,1769.775394,1831.796100,1806.395305,1730.148122,1861.627770,1865.829778,1881.066844,1887.931503

### Monthly aggregation

In [17]:
df_monthly  = train_data.groupby(pd.Grouper(key='times',freq='M')).sum()
df_monthly.head(3)

,Series1,Series2,Series3,Series4,Series5,Series6,Series7,Series8,Series9,Series10,...,Series86,Series87,Series88,Series89,Series90,Series91,Series92,Series93,Series94,Series95
times,,,,,,,,,,,,,,,,,,,,,
1978-11-30,7656.715500,7881.887572,7870.854326,7752.660567,7581.901560,7690.017034,7868.409673,7843.973688,9605.083966,8172.032592,...,7754.436053,7606.773333,7517.935800,7762.665828,7798.696142,7863.753357,8042.350175,7910.327749,8062.019113,8082.799024
1978-12-31,7875.728987,7874.999700,7872.613723,7899.516216,7663.898783,7740.251913,7780.484120,7708.052874,7922.045601,8149.144537,...,7720.968850,7904.003893,7719.780393,10192.002465,7754.513264,8099.610586,7952.848617,8013.071453,8030.335268,8177.502259
1979-01-31,7685.564114,7654.200090,7737.313782,7644.405067,7694.135194,7567.465669,7601.845808,7570.640705,7758.095295,7886.464706,...,7494.091124,7576.037977,7587.286562,7753.301233,7478.188333,7842.153085,7644.690077,7950.554917,7804.167895,7836.404477